; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob3) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate7)
	(at pallet1 distributor0)
	(clear crate5)
	(at pallet2 distributor1)
	(clear crate6)
	(at truck0 depot0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 279)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 326)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor1)
	(on crate0 pallet2)
	(= (weight crate0) 14)
	(at crate1 distributor0)
	(on crate1 pallet1)
	(= (weight crate1) 57)
	(at crate2 distributor1)
	(on crate2 crate0)
	(= (weight crate2) 21)
	(at crate3 distributor1)
	(on crate3 crate2)
	(= (weight crate3) 78)
	(at crate4 depot0)
	(on crate4 pallet0)
	(= (weight crate4) 10)
	(at crate5 distributor0)
	(on crate5 crate1)
	(= (weight crate5) 22)
	(at crate6 distributor1)
	(on crate6 crate3)
	(= (weight crate6) 31)
	(at crate7 depot0)
	(on crate7 crate4)
	(= (weight crate7) 25)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet0)
		(on crate1 crate2)
		(on crate2 crate5)
		(on crate3 crate6)
		(on crate4 crate3)
		(on crate5 crate0)
		(on crate6 pallet1)
		(on crate7 pallet2)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist1 crate5 crate1 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate1)
   added: (lifting hoist1 crate5) (clear crate1)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 8
2. (lift hoist0 crate7 crate4 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate4)
   added: (lifting hoist0 crate7) (clear crate4)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 8
3. (load hoist0 crate7 truck0 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 25
   goals met: 0 of 8
4. (lift hoist0 crate4 pallet0 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 pallet0)
   added: (lifting hoist0 crate4) (clear pallet0)
   changed: (fuel-cost) from 2 to 3
   goals met: 0 of 8
5. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   changed: (current_load truck1) from 0 to 10
   goals met: 0 of 8
6. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 3 to 13
   goals met: 0 of 8
7. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 13 to 23
   goals met: 0 of 8
8. (lift hoist2 crate6 crate3 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist2) (on crate6 crate3)
   added: (lifting hoist2 crate6) (clear crate3)
   changed: (fuel-cost) from 23 to 24
   goals met: 0 of 8
9. (load hoist2 crate6 truck0 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   changed: (current_load truck0) from 25 to 56
   goals met: 0 of 8
10. (lift hoist2 crate3 crate2 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 crate2)
   added: (lifting hoist2 crate3) (clear crate2)
   changed: (fuel-cost) from 24 to 25
   goals met: 0 of 8
11. (load hoist2 crate3 truck1 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   changed: (current_load truck1) from 10 to 88
   goals met: 0 of 8
12. (drop hoist1 crate5 crate1 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate1)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 crate1)
   goals met: 0 of 8
13. (unload hoist2 crate7 truck0 distributor1)
   deleted: (in crate7 truck0) (available hoist2)
   added: (lifting hoist2 crate7)
   changed: (current_load truck0) from 56 to 31
   goals met: 0 of 8
14. (load hoist2 crate7 truck1 distributor1)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck1) (available hoist2)
   changed: (current_load truck1) from 88 to 113
   goals met: 0 of 8
15. (lift hoist2 crate2 crate0 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 crate0)
   added: (lifting hoist2 crate2) (clear crate0)
   changed: (fuel-cost) from 25 to 26
   goals met: 0 of 8
16. (load hoist2 crate2 truck1 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck1) (available hoist2)
   changed: (current_load truck1) from 113 to 134
   goals met: 0 of 8
17. (lift hoist2 crate0 pallet2 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   changed: (fuel-cost) from 26 to 27
   goals met: 0 of 8
18. (lift hoist1 crate5 crate1 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate1)
   added: (lifting hoist1 crate5) (clear crate1)
   changed: (fuel-cost) from 27 to 28
   goals met: 0 of 8
19. (load hoist2 crate0 truck1 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck1) (available hoist2)
   changed: (current_load truck1) from 134 to 148
   goals met: 0 of 8
20. (unload hoist2 crate7 truck1 distributor1)
   deleted: (in crate7 truck1) (available hoist2)
   added: (lifting hoist2 crate7)
   changed: (current_load truck1) from 148 to 123
   goals met: 0 of 8
21. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 28 to 38
   goals met: 0 of 8
22. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 38 to 48
   goals met: 0 of 8
23. (load hoist1 crate5 truck1 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck1) (available hoist1)
   changed: (current_load truck1) from 123 to 145
   goals met: 0 of 8
24. (lift hoist1 crate1 pallet1 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   changed: (fuel-cost) from 48 to 49
   goals met: 0 of 8
25. (drop hoist2 crate7 pallet2 distributor1)
   deleted: (lifting hoist2 crate7) (clear pallet2)
   added: (available hoist2) (at crate7 distributor1) (clear crate7) (on crate7 pallet2)
   goals met: 1 of 8
26. (load hoist1 crate1 truck1 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck1) (available hoist1)
   changed: (current_load truck1) from 145 to 202
   goals met: 1 of 8
27. (unload hoist1 crate6 truck0 distributor0)
   deleted: (in crate6 truck0) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck0) from 31 to 0
   goals met: 1 of 8
28. (drop hoist1 crate6 pallet1 distributor0)
   deleted: (lifting hoist1 crate6) (clear pallet1)
   added: (available hoist1) (at crate6 distributor0) (clear crate6) (on crate6 pallet1)
   goals met: 2 of 8
29. (unload hoist1 crate3 truck1 distributor0)
   deleted: (in crate3 truck1) (available hoist1)
   added: (lifting hoist1 crate3)
   changed: (current_load truck1) from 202 to 124
   goals met: 2 of 8
30. (drop hoist1 crate3 crate6 distributor0)
   deleted: (lifting hoist1 crate3) (clear crate6)
   added: (available hoist1) (at crate3 distributor0) (clear crate3) (on crate3 crate6)
   goals met: 3 of 8
31. (unload hoist1 crate4 truck1 distributor0)
   deleted: (in crate4 truck1) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck1) from 124 to 114
   goals met: 3 of 8
32. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 49 to 59
   goals met: 3 of 8
33. (drop hoist1 crate4 crate3 distributor0)
   deleted: (lifting hoist1 crate4) (clear crate3)
   added: (available hoist1) (at crate4 distributor0) (clear crate4) (on crate4 crate3)
   goals met: 4 of 8
34. (unload hoist0 crate0 truck1 depot0)
   deleted: (in crate0 truck1) (available hoist0)
   added: (lifting hoist0 crate0)
   changed: (current_load truck1) from 114 to 100
   goals met: 4 of 8
35. (drop hoist0 crate0 pallet0 depot0)
   deleted: (lifting hoist0 crate0) (clear pallet0)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 pallet0)
   goals met: 5 of 8
36. (unload hoist0 crate5 truck1 depot0)
   deleted: (in crate5 truck1) (available hoist0)
   added: (lifting hoist0 crate5)
   changed: (current_load truck1) from 100 to 78
   goals met: 5 of 8
37. (drop hoist0 crate5 crate0 depot0)
   deleted: (lifting hoist0 crate5) (clear crate0)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 crate0)
   goals met: 6 of 8
38. (unload hoist0 crate2 truck1 depot0)
   deleted: (in crate2 truck1) (available hoist0)
   added: (lifting hoist0 crate2)
   changed: (current_load truck1) from 78 to 57
   goals met: 6 of 8
39. (drop hoist0 crate2 crate5 depot0)
   deleted: (lifting hoist0 crate2) (clear crate5)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 crate5)
   goals met: 7 of 8
40. (unload hoist0 crate1 truck1 depot0)
   deleted: (in crate1 truck1) (available hoist0)
   added: (lifting hoist0 crate1)
   changed: (current_load truck1) from 57 to 0
   goals met: 7 of 8
41. (drop hoist0 crate1 crate2 depot0)
   deleted: (lifting hoist0 crate1) (clear crate2)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 crate2)
   goals met: 8 of 8
